Reports/ОтчетПоПродажамИПотеряннымПродажам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетПоПродажамИПотеряннымПродажам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьПродажиБезСкидок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПотерянныеПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПродажиСоСкидками</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТТМиниТТПусто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоВВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДегустациюОбеды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоПерекрестки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоПятерочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ОтчетПоПродажамИПотеряннымПродажам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ВыводитьПродажиБезСкидок 	= Истина;
	Отчет.ВыводитьПотерянныеПродажи = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость()
	
	Элементы.ГруппаПоПродажам.Видимость = (НаборДанных = 0);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыводитьТТМиниТТПустоПриИзменении(Элемент)
	
	Если Отчет.ВыводитьТТМиниТТПусто Тогда
		Отчет.ВыводитьТолькоВВ = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьТолькоВВПриИзменении(Элемент)
	
	Если Отчет.ВыводитьТолькоВВ Тогда
		Отчет.ВыводитьТТМиниТТПусто = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборДанныхПриИзменении(Элемент)
	
	НастроитьВидимость();
	Отчет.ВыводитьДегустациюОбеды = (НаборДанных = 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимость();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыводитьТолькоПерекресткиПриИзменении(Элемент)
	Если Отчет.ВыводитьТолькоПерекрестки Тогда
		Отчет.ВыводитьТолькоПятерочки = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВыводитьТолькоПятерочкиПриИзменении(Элемент)
	Если Отчет.ВыводитьТолькоПятерочки Тогда
		Отчет.ВыводитьТолькоПерекрестки = Ложь;
	КонецЕсли;
КонецПроцедуры
